jSeduiteBpelComponent/test/TvShows-GetShowsForTonight/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tvs="http://modalis.i3s.unice.fr/jSeduite/orchestrations/schema/TvShows">
  <soapenv:Body>
    <tvs:GetShowsForTonightRequest>
      <tvs:provider></tvs:provider>
      <tvs:period>0</tvs:period>
    </tvs:GetShowsForTonightRequest>
  </soapenv:Body>
</soapenv:Envelope>